aroyer-qc/Digini/Peripheral/inc/port/STM32F4xx/lib_STM32F4_system_clock.h
//-------------------------------------------------------------------------------------------------
//
//  File : lib_STM32F4_system_clock.h
//
//-------------------------------------------------------------------------------------------------
//
// Copyright(c) 2024 Alain Royer.
// Email: aroyer.qc@gmail.com
//
// Permission is hereby granted, free of charge, to any person obtaining a copy of this software
// and associated documentation files (the "Software"), to deal in the Software without
// restriction, including without limitation the rights to use, copy, modify, merge, publish,
// distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the
// Software is furnished to do so, subject to the following conditions:
//
// The above copyright notice and this permission notice shall be included in all copies or
// substantial portions of the Software.
//
// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED,
// INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE
// AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM,
// DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
//
//-------------------------------------------------------------------------------------------------

#pragma once

//-------------------------------------------------------------------------------------------------
// Include(s)
//-------------------------------------------------------------------------------------------------

#include "stm32f4xx.h"
#include <stdbool.h>
#include "./Digini/inc/lib_macro.h"

//-------------------------------------------------------------------------------------------------
// Define(s)
//-------------------------------------------------------------------------------------------------

#define LSI_CLOCK_FREQUENCY                         32000
#define HSI_CLOCK_FREQUENCY                         16000000

// Own define for register bit value without cast (Do not change)
#define CFG_RCC_CFGR_SW_HSI                         0x00000000U
#define CFG_RCC_CFGR_SW_HSE                         0x00000001U
#define CFG_RCC_CFGR_SW_PLL                         0x00000002U

#define CFG_RCC_PLLCFGR_PLLSRC_HSE                  0x00400000U
#define CFG_RCC_PLLCFGR_PLLSRC_HSI                  0x00000000U

#define CFG_RCC_CFGR_HPRE_DIV1                      0x00000000U
#define CFG_RCC_CFGR_HPRE_DIV2                      0x00000080U
#define CFG_RCC_CFGR_HPRE_DIV4                      0x00000090U
#define CFG_RCC_CFGR_HPRE_DIV8                      0x000000A0U
#define CFG_RCC_CFGR_HPRE_DIV16                     0x000000B0U
#define CFG_RCC_CFGR_HPRE_DIV64                     0x000000C0U
#define CFG_RCC_CFGR_HPRE_DIV128                    0x000000D0U
#define CFG_RCC_CFGR_HPRE_DIV256                    0x000000E0U
#define CFG_RCC_CFGR_HPRE_DIV512                    0x000000F0U

#define CFG_RCC_CFGR_PPRE1_DIV1                     0x00000000U
#define CFG_RCC_CFGR_PPRE1_DIV2                     0x00001000U
#define CFG_RCC_CFGR_PPRE1_DIV4                     0x00001400U
#define CFG_RCC_CFGR_PPRE1_DIV8                     0x00001800U
#define CFG_RCC_CFGR_PPRE1_DIV16                    0x00001C00U

#define CFG_RCC_CFGR_PPRE2_DIV1                     0x00000000U
#define CFG_RCC_CFGR_PPRE2_DIV2                     0x00008000U
#define CFG_RCC_CFGR_PPRE2_DIV4                     0x0000A000U
#define CFG_RCC_CFGR_PPRE2_DIV8                     0x0000C000U
#define CFG_RCC_CFGR_PPRE2_DIV16                    0x0000E000U

#define CFG_RCC_CFGR_MCO1PRE_NO_DIV                 0x00000000U
#define CFG_RCC_CFGR_MCO1PRE_DIV2                   0x04000000U
#define CFG_RCC_CFGR_MCO1PRE_DIV3                   0x05000000U
#define CFG_RCC_CFGR_MCO1PRE_DIV4                   0x06000000U
#define CFG_RCC_CFGR_MCO1PRE_DIV5                   0x07000000U

#define CFG_RCC_CFGR_MCO1_HSI                       0x00000000U
#define CFG_RCC_CFGR_MCO1_LSE                       0x00200000U
#define CFG_RCC_CFGR_MCO1_HSE                       0x00400000U
#define CFG_RCC_CFGR_MCO1_PLL                       0x00600000U

#define CFG_RCC_CFGR_MCO2PRE_NO_DIV                 0x00000000U
#define CFG_RCC_CFGR_MCO2PRE_DIV2                   0x20000000U
#define CFG_RCC_CFGR_MCO2PRE_DIV3                   0x28000000U
#define CFG_RCC_CFGR_MCO2PRE_DIV4                   0x30000000U
#define CFG_RCC_CFGR_MCO2PRE_DIV5                   0x38000000U

#define CFG_RCC_CFGR_MCO2_SYSCLOCK                  0x00000000U
#define CFG_RCC_CFGR_MCO2_PLLI2S                    0x40000000U
#define CFG_RCC_CFGR_MCO2_HSE                       0x80000000U
#define CFG_RCC_CFGR_MCO2_PLL                       0xC0000000U

#define CFG_RCC_BDCR_RTCSEL_NO_CLOCK                0x00000000U
#define CFG_RCC_BDCR_RTCSEL_LSE                     0x00000100U
#define CFG_RCC_BDCR_RTCSEL_LSI                     0x00000200U
#define CFG_RCC_BDCR_RTCSEL_HSE                     0x00000300U

#if defined(STM32F401xC) || defined(STM32F401xE)
    #define CFG_MAX_CPU_SYS_HCLK_CLOCK_FREQUENCY    (84000000U)
    #define CFG_MAX_APB1_CLOCK_FREQUENCY            (42000000U)
    #define CFG_MAX_APB2_CLOCK_FREQUENCY            (84000000U)
#elif defined(STM32F405xx) || defined(STM32F407xx) || defined(STM32F415xx) || defined(STM32F417xx)
    #define CFG_MAX_CPU_SYS_HCLK_CLOCK_FREQUENCY    (168000000U)
    #define CFG_MAX_APB1_CLOCK_FREQUENCY            (42000000U)
    #define CFG_MAX_APB2_CLOCK_FREQUENCY            (84000000U)
#elif defined(STM32F410Tx) || defined(STM32F410Cx) || defined(STM32F410Rx) || defined(STM32F411xE) || defined(STM32F412Cx) || defined(STM32F412Zx) || \
      defined(STM32F412Rx) || defined(STM32F412Vx) || defined(STM32F413xx) || defined(STM32F423xx)
    #define CFG_MAX_CPU_SYS_HCLK_CLOCK_FREQUENCY    (100000000U)
    #define CFG_MAX_APB1_CLOCK_FREQUENCY            (50000000U)
    #define CFG_MAX_APB2_CLOCK_FREQUENCY            (100000000U)
#elif defined(STM32F427xx) || defined(STM32F429xx) || defined(STM32F437xx) || defined(STM32F439xx) || defined(STM32F446xx) || defined(STM32F469xx) || defined(STM32F479xx)
    #define CFG_MAX_CPU_SYS_HCLK_CLOCK_FREQUENCY    (180000000U)
    #define CFG_MAX_APB1_CLOCK_FREQUENCY            (45000000U)
    #define CFG_MAX_APB2_CLOCK_FREQUENCY            (90000000U)
#endif

#if defined(STM32F427xx) || defined(STM32F429xx) || defined(STM32F437xx) || defined(STM32F439xx) || defined(STM32F469xx) || defined(STM32F479xx)
#define CFG_RCC_DCKCFGR_PLLSAI_Q_DIV(x)            ((x - 1) << RCC_DCKCFGR_PLLSAIDIVQ_Pos)

#define CFG_RCC_DCKCFGR_PLLSAI_R_DIV2               0x00000000U
#define CFG_RCC_DCKCFGR_PLLSAI_R_DIV4               RCC_DCKCFGR_PLLSAIDIVR_0
#define CFG_RCC_DCKCFGR_PLLSAI_R_DIV8               RCC_DCKCFGR_PLLSAIDIVR_1
#define CFG_RCC_DCKCFGR_PLLSAI_R_DIV16              (RCC_DCKCFGR_PLLSAIDIVR_1 | RCC_DCKCFGR_PLLSAIDIVR_0)
#endif

#if defined(STM32F427xx) || defined(STM32F429xx) || defined(STM32F437xx) || defined(STM32F439xx) || defined(STM32F469xx) || defined(STM32F479xx)
#define CFG_RCC_DCKCFGR_PLLI2S_Q_DIV(x)             ((x - 1) << RCC_DCKCFGR_PLLI2SDIVQ_Pos)
#endif

//-------------------------------------------------------------------------------------------------
// Multiplexer for peripheral clock source (TODO missing one)

#define CFG_I2S_PLLI2S_R                            0
#define CFG_I2S_I2S_CKIN                            RCC_CFGR_I2SSRC

#if defined(STM32F427xx) || defined(STM32F429xx) || defined(STM32F437xx) || defined(STM32F439xx) || defined(STM32F469xx) || defined(STM32F479xx)
#define CFG_SAI1_PLLSAI_Q                           0
#define CFG_SAI1_PLLI2S_Q                           RCC_DCKCFGR_SAI1ASRC_0
#define CFG_SAI1_EXT_CLK                            RCC_DCKCFGR_SAI1ASRC_1
#endif

#define CFG_SAI2_PLLSAI_Q                           0
#define CFG_SAI2_PLLI2S_Q                           RCC_DCKCFGR1_SAI2SEL_0
#define CFG_SAI2_EXT_CLK                            RCC_DCKCFGR1_SAI2SEL_1

#define CFG_MCO1_HSI                                0
#define CFG_MCO1_LSE                                RCC_CFGR_MCO1_0
#define CFG_MCO1_HSE                                RCC_CFGR_MCO1_1
#define CFG_MCO1_PLL_CLK                            (RCC_CFGR_MCO1_1 | RCC_CFGR_MCO1_0)

#define CFG_MCO2_SYS_CLK                            0
#define CFG_MCO2_PLLI2S_R                           RCC_CFGR_MCO2_0
#define CFG_MCO2_HSE                                RCC_CFGR_MCO2_1
#define CFG_MCO2_PLL_CLK                            (RCC_CFGR_MCO2_1 | RCC_CFGR_MCO2_0)

//-------------------------------------------------------------------------------------------------
// Configuration file(s)
//-------------------------------------------------------------------------------------------------

#include "clock_cfg.h"

//-------------------------------------------------------------------------------------------------
// default
//-------------------------------------------------------------------------------------------------

#ifdef CFG_LSE_VALUE
  #define LSE_CLOCK_FREQUENCY                       CFG_LSE_VALUE
#else
  #define LSE_CLOCK_FREQUENCY                       32768
#endif

//-------------------------------------------------------------------------------------------------
// Auto define configuration
//-------------------------------------------------------------------------------------------------

#define CFG_RCC_CFGR_RTCPRE                         ((CFG_HSE_VALUE / 1000000) << RCC_CFGR_RTCPRE_Pos)

#define CFG_RCC_PLLCFGR_PLL_M_POS                   0
#define CFG_RCC_PLLCFGR_PLL_N_POS                   6
#define CFG_RCC_PLLCFGR_PLL_P_POS                   16
#define CFG_RCC_PLLCFGR_PLL_Q_POS                   24

//-------------------------------------------------------------------------------------------------
// Auto configuration value for PLL
#if (CFG_SYS_CLOCK_MUX == CFG_RCC_CFGR_SW_PLL)

  #define CFG_PLL_CLK_FREQUENCY                     (((CFG_PLL_SOURCE / CFG_PLL_M_DIVIDER) * CFG_PLL_N_MULTIPLIER) / CFG_PLL_P_DIVIDER)
  #define CFG_PLL_Q_FREQUENCY                       (((CFG_PLL_SOURCE / CFG_PLL_M_DIVIDER) * CFG_PLL_N_MULTIPLIER) / CFG_PLL_Q_DIVIDER)

  #if (CFG_PLL_M_DIVIDER < 2) || (CFG_PLL_M_DIVIDER > 63)
    #pragma message "XSTR(CFG_PLL_M_DIVIDER)"
    #error PLL_M is out of range
  #else
    #define CFG_RCC_PLLCFGR_PLL_M                   (CFG_PLL_M_DIVIDER << CFG_RCC_PLLCFGR_PLL_M_POS)
  #endif

  #if (CFG_PLL_N_MULTIPLIER < 50) || (CFG_PLL_N_MULTIPLIER > 432)
    #pragma message "XSTR(CFG_PLL_N_MULTIPLIER)"
    #error PLL_N is out of range
  #else
    #define CFG_RCC_PLLCFGR_PLL_N                   (CFG_PLL_N_MULTIPLIER << CFG_RCC_PLLCFGR_PLL_N_POS)
  #endif

  #if ((CFG_PLL_P_DIVIDER / 2) < 1) || ((CFG_PLL_P_DIVIDER / 2) > 4)   // (tested for 2,4,6,8)
    #pragma message "XSTR(CFG_PLL_P_DIVIDER)"
    #error PLL_P is out of range
  #else
    #define CFG_RCC_PLLCFGR_PLL_P                   (((CFG_PLL_P_DIVIDER / 2) - 1) << CFG_RCC_PLLCFGR_PLL_P_POS)
  #endif

  #if (CFG_PLL_Q_DIVIDER < 2) || (CFG_PLL_Q_DIVIDER > 15)
    #pragma message "XSTR(CFG_PLL_Q_DIVIDER)"
    #error PLL_Q is out of range
  #else
    #define CFG_RCC_PLLCFGR_PLL_Q                   (CFG_PLL_Q_DIVIDER << CFG_RCC_PLLCFGR_PLL_Q_POS)
  #endif

  #define CFG_RCC_PLLCFGR_CFG                       (CFG_RCC_PLLCFGR_PLL_M |   \
                                                     CFG_RCC_PLLCFGR_PLL_N |   \
                                                     CFG_RCC_PLLCFGR_PLL_P |   \
                                                     CFG_RCC_PLLCFGR_PLL_Q |   \
                                                     CFG_RCC_PLLCFGR_PLLSRC)

  #define CFG_SYS_PLL_CLK_FREQUENCY                 CFG_PLL_CLK_FREQUENCY


#endif // CFG_SYS_CLOCK_MUX == RCC_CFGR_SW_PLL

// --------------------------------------------------------------------------------------------------------------------------------
// PLLI2S
  #if (CFG_PLLI2S_N_MULTIPLIER < 50) || (CFG_PLLI2S_N_MULTIPLIER > 432)
    #pragma message "XSTR(CFG_PLLSAI_N_MULTIPLIER)"
    #error I2S PLLN is out of range
  #else
    #define CFG_RCC_PLLI2S_CFGR_PLLN                (CFG_PLLI2S_N_MULTIPLIER << RCC_PLLI2S_CFGR_PLL_N_POS)
  #endif

 #if defined(STM32F427xx) || defined(STM32F429xx) || defined(STM32F437xx) || defined(STM32F439xx) || defined(STM32F469xx) || defined(STM32F479xx)
  #if (CFG_PLLI2S_Q_DIVIDER < 2) || (CFG_PLLI2S_Q_DIVIDER > 15)
    #pragma message "XSTR(CFG_PLLI2S_Q_DIVIDER)"
    #error I2S PLLQ is out of range
  #else
    #define CFG_RCC_PLLI2S_CFGR_PLLQ                (CFG_PLLI2S_Q_DIVIDER << RCC_PLLI2S_CFGR_PLL_Q_POS)
  #endif
 #endif

  #if (CFG_PLLI2S_R_DIVIDER < 2) || (CFG_PLLI2S_R_DIVIDER > 7)
    #pragma message "XSTR(CFG_PLLI2S_R_DIVIDER)"
    #error I2S PLLR is out of range
  #else
    #define CFG_RCC_PLLI2S_CFGR_PLLR                (CFG_PLLI2S_R_DIVIDER << RCC_PLLI2S_CFGR_PLL_R_POS)
  #endif

  #define CFG_RCC_PLLI2S_CFGR                       (CFG_RCC_PLLI2S_CFGR_PLLN |   \
                                                     CFG_RCC_PLLI2S_CFGR_PLLQ |   \
                                                     CFG_RCC_PLLI2S_CFGR_PLLQ)

  #define PLLI2SN_CLOCK_FREQUENCY                   ((CFG_PLL_SOURCE / CFG_PLL_M_DIVIDER) * CFG_PLLI2S_N_MULTIPLIER)
 #if defined(STM32F427xx) || defined(STM32F429xx) || defined(STM32F437xx) || defined(STM32F439xx) || defined(STM32F469xx) || defined(STM32F479xx)
  #define PLLI2SQ_CLOCK_FREQUENCY                   (PLLI2SN_CLOCK_FREQUENCY / CFG_PLLI2S_Q_DIVIDER)
 #endif
  #define PLLI2SR_CLOCK_FREQUENCY                   (PLLI2SN_CLOCK_FREQUENCY / CFG_PLLI2S_R_DIVIDER)

// --------------------------------------------------------------------------------------------------------------------------------
// PLLSAI
 #if defined(STM32F427xx) || defined(STM32F429xx) || defined(STM32F437xx) || defined(STM32F439xx) || defined(STM32F469xx) || defined(STM32F479xx)
  #if (CFG_PLLSAI_N_MULTIPLIER < 50) || (CFG_PLLSAI_N_MULTIPLIER > 432)
    #pragma message "XSTR(CFG_PLLSAI_N_MULTIPLIER)"
    #error SAI PLLN is out of range
  #else
    #define CFG_RCC_PLLSAI_CFGR_PLLN                (CFG_PLLSAI_N_MULTIPLIER << RCC_PLLSAI_CFGR_PLL_N_POS)
  #endif

  #if (CFG_PLLSAI_Q_DIVIDER < 2) || (CFG_PLLSAI_Q_DIVIDER > 15)
    #pragma message "XSTR(CFG_PLLSAI_Q_DIVIDER)"
    #error SAI PLLQ is out of range
  #else
    #define CFG_RCC_PLLSAI_CFGR_PLLQ                (CFG_PLLSAI_Q_DIVIDER << RCC_PLLSAI_CFGR_PLL_Q_POS)
  #endif

  #if (CFG_PLLSAI_R_DIVIDER < 2) || (CFG_PLLSAI_R_DIVIDER > 7)
    #pragma message "XSTR(CFG_PLLSAI_R_DIVIDER)"
    #error SAI PLLR is out of range
  #else
    #define CFG_RCC_PLLSAI_CFGR_PLLR                (CFG_PLLSAI_R_DIVIDER << RCC_PLLSAI_CFGR_PLL_R_POS)
  #endif

  #define CFG_RCC_PLLSAI_CFGR                       (CFG_RCC_PLLSAI_CFGR_PLLN |   \
                                                     CFG_RCC_PLLSAI_CFGR_PLLQ |   \
                                                     CFG_RCC_PLLSAI_CFGR_PLLQ)

  #define PLLSAIN_CLOCK_FREQUENCY                   ((CFG_PLL_SOURCE / CFG_PLL_M_DIVIDER) * CFG_PLLSAI_N_MULTIPLIER)
  #define PLLSAIQ_CLOCK_FREQUENCY                   (PLLSAIN_CLOCK_FREQUENCY / CFG_PLLSAI_Q_DIVIDER)
  #define PLLSAIR_CLOCK_FREQUENCY                   (PLLSAIN_CLOCK_FREQUENCY / CFG_PLLSAI_R_DIVIDER)
 #endif
// --------------------------------------------------------------------------------------------------------------------------------

#if (CFG_SYS_CLOCK_MUX == CFG_RCC_CFGR_SW_PLL)
  #define SYS_CPU_CORE_CLOCK_FREQUENCY              CFG_SYS_PLL_CLK_FREQUENCY
#elif (CFG_SYS_CLOCK_MUX == CFG_RCC_CFGR_SW_HSE)
  #define SYS_CPU_CORE_CLOCK_FREQUENCY              CFG_HSE_VALUE
#else //(CFG_SYS_CLOCK_MUX == CFG_RCC_CFGR_SW_HSI)
  #define SYS_CPU_CORE_CLOCK_FREQUENCY              CFG_HSI_VALUE
#endif


#if   CFG_AHB_CLK_DIVIDER == CFG_RCC_CFGR_HPRE_DIV1
    #define SYS_HCLK_CLOCK_FREQUENCY                SYS_CPU_CORE_CLOCK_FREQUENCY
#elif CFG_AHB_CLK_DIVIDER == CFG_RCC_CFGR_HPRE_DIV2
    #define SYS_HCLK_CLOCK_FREQUENCY                (SYS_CPU_CORE_CLOCK_FREQUENCY / 2)
#elif CFG_AHB_CLK_DIVIDER == CFG_RCC_CFGR_HPRE_DIV4
    #define SYS_HCLK_CLOCK_FREQUENCY                (SYS_CPU_CORE_CLOCK_FREQUENCY / 4)
#elif CFG_AHB_CLK_DIVIDER == CFG_RCC_CFGR_HPRE_DIV8
    #define SYS_HCLK_CLOCK_FREQUENCY                (SYS_CPU_CORE_CLOCK_FREQUENCY / 8)
#elif CFG_AHB_CLK_DIVIDER == CFG_RCC_CFGR_HPRE_DIV16
    #define SYS_HCLK_CLOCK_FREQUENCY                (SYS_CPU_CORE_CLOCK_FREQUENCY / 16)
#elif CFG_AHB_CLK_DIVIDER == CFG_RCC_CFGR_HPRE_DIV64
    #define SYS_HCLK_CLOCK_FREQUENCY                (SYS_CPU_CORE_CLOCK_FREQUENCY / 64)
#elif CFG_AHB_CLK_DIVIDER == CFG_RCC_CFGR_HPRE_DIV128
    #define SYS_HCLK_CLOCK_FREQUENCY                (SYS_CPU_CORE_CLOCK_FREQUENCY / 128)
#elif CFG_AHB_CLK_DIVIDER == CFG_RCC_CFGR_HPRE_DIV256
    #define SYS_HCLK_CLOCK_FREQUENCY                (SYS_CPU_CORE_CLOCK_FREQUENCY / 256)
#elif CFG_AHB_CLK_DIVIDER == CFG_RCC_CFGR_HPRE_DIV512
    #define SYS_HCLK_CLOCK_FREQUENCY                (SYS_CPU_CORE_CLOCK_FREQUENCY / 512)
#endif
#define CFG_SYS_HCLK                                CFG_AHB_CLK_DIVIDER

#define SYSTEM_CORE_CLOCK                           SYS_CPU_CORE_CLOCK_FREQUENCY

#if   CFG_APB1_CLK_DIVIDER == CFG_RCC_CFGR_PPRE1_DIV1
    #define SYS_APB1_CLOCK_FREQUENCY                SYS_HCLK_CLOCK_FREQUENCY
#elif CFG_APB1_CLK_DIVIDER == CFG_RCC_CFGR_PPRE1_DIV2
    #define SYS_APB1_CLOCK_FREQUENCY                (SYS_HCLK_CLOCK_FREQUENCY / 2)
#elif CFG_APB1_CLK_DIVIDER == CFG_RCC_CFGR_PPRE1_DIV4
    #define SYS_APB1_CLOCK_FREQUENCY                (SYS_HCLK_CLOCK_FREQUENCY / 4)
#elif APB1_CLK_DIVIDER == CFG_RCC_CFGR_PPRE1_DIV8
    #define SYS_APB1_CLOCK_FREQUENCY                (SYS_HCLK_CLOCK_FREQUENCY / 8)
#elif CFG_APB1_CLK_DIVIDER == CFG_RCC_CFGR_PPRE1_DIV16
    #define SYS_APB1_CLOCK_FREQUENCY                (SYS_HCLK_CLOCK_FREQUENCY / 16)
#endif
#define CFG_SYS_APB1                                CFG_APB1_CLK_DIVIDER
#define SYS_APB1_TIMER_CLOCK_FREQUENCY              (SYS_APB1_CLOCK_FREQUENCY * 2)

#if   CFG_APB2_CLK_DIVIDER == CFG_RCC_CFGR_PPRE2_DIV1
    #define SYS_APB2_CLOCK_FREQUENCY                SYS_HCLK_CLOCK_FREQUENCY
#elif CFG_APB2_CLK_DIVIDER == CFG_RCC_CFGR_PPRE2_DIV2
    #define SYS_APB2_CLOCK_FREQUENCY                (SYS_HCLK_CLOCK_FREQUENCY / 2)
#elif CFG_APB2_CLK_DIVIDER == CFG_RCC_CFGR_PPRE2_DIV4
    #define SYS_APB2_CLOCK_FREQUENCY                (SYS_HCLK_CLOCK_FREQUENCY / 4)
#elif CFG_APB2_CLK_DIVIDER == CFG_RCC_CFGR_PPRE2_DIV8
    #define SYS_APB2_CLOCK_FREQUENCY                (SYS_HCLK_CLOCK_FREQUENCY / 8)
#elif CFG_APB2_CLK_DIVIDER == CFG_RCC_CFGR_PPRE2_DIV16
    #define SYS_APB2_CLOCK_FREQUENCY                (SYS_HCLK_CLOCK_FREQUENCY / 16)
#endif
#define CFG_SYS_APB2                                CFG_APB2_CLK_DIVIDER
#define SYS_APB2_TIMER_CLOCK_FREQUENCY              SYS_APB2_CLOCK_FREQUENCY * 2


// Power scaling according to speed
#if (SYS_CPU_CORE_CLOCK_FREQUENCY <= 144000000)
#define POWER_REGULATOR_CFG                         0
#else // (SYS_CPU_CORE_CLOCK_FREQUENCY <= 168000000)
#define POWER_REGULATOR_CFG                         PWR_CR_VOS_0
#endif

// Flash Latency configuration for Voltage from 2.7V to 3.6V
#if   (SYS_CPU_CORE_CLOCK_FREQUENCY <= 30000000)
#define CFG_FLASH_LATENCY                           FLASH_ACR_LATENCY_0WS
#elif (SYS_CPU_CORE_CLOCK_FREQUENCY <= 60000000)
#define CFG_FLASH_LATENCY                           FLASH_ACR_LATENCY_1WS
#elif (SYS_CPU_CORE_CLOCK_FREQUENCY <= 90000000)
#define CFG_FLASH_LATENCY                           FLASH_ACR_LATENCY_2WS
#elif (SYS_CPU_CORE_CLOCK_FREQUENCY <= 120000000)
#define CFG_FLASH_LATENCY                           FLASH_ACR_LATENCY_3WS
#elif (SYS_CPU_CORE_CLOCK_FREQUENCY <= 150000000)
#define CFG_FLASH_LATENCY                           FLASH_ACR_LATENCY_4WS
#elif (SYS_CPU_CORE_CLOCK_FREQUENCY <= 168000000)
#define CFG_FLASH_LATENCY                           FLASH_ACR_LATENCY_5WS
#endif

// --------------------------------------------------------------------------------------------------------------------------------

#if   (SYS_CPU_CORE_CLOCK_FREQUENCY >= 150000000)
#define ETH_MACIIAR_CR_DIVIDER                      ETH_MACMIIAR_CR_Div102
#elif (SYS_CPU_CORE_CLOCK_FREQUENCY >= 100000000)
#define ETH_MACIIAR_CR_DIVIDER                      ETH_MACMIIAR_CR_Div62
#elif (SYS_CPU_CORE_CLOCK_FREQUENCY >= 60000000)
#define ETH_MACIIAR_CR_DIVIDER                      ETH_MACMIIAR_CR_Div42
#elif (SYS_CPU_CORE_CLOCK_FREQUENCY >= 35000000)
#define ETH_MACIIAR_CR_DIVIDER                      ETH_MACMIIAR_CR_Div26
#elif (SYS_CPU_CORE_CLOCK_FREQUENCY >= 20000000)
#define ETH_MACIIAR_CR_DIVIDER                      ETH_MACMIIAR_CR_Div16
#endif

// Verification
#if SYS_HCLK_CLOCK_FREQUENCY > CFG_MAX_CPU_SYS_HCLK_CLOCK_FREQUENCY
 #pragma message "XSTR(SYS_HCLK_CLOCK_FREQUENCY)"
 #error CPU Core frequency exceed maximum allowed!
#endif

#if SYS_APB1_CLOCK_FREQUENCY > CFG_MAX_APB1_CLOCK_FREQUENCY
 #pragma message "XSTR(SYS_APB1_CLOCK_FREQUENCY)"
 #error APB1 frequency exceed maximum allowed!
#endif

#if SYS_APB2_CLOCK_FREQUENCY > CFG_MAX_APB2_CLOCK_FREQUENCY
 #pragma message "XSTR(SYS_APB2_CLOCK_FREQUENCY)"
 #error APB2 frequency exceed maximum allowed!
#endif

//-------------------------------------------------------------------------------------------------
// Global Macro
//-------------------------------------------------------------------------------------------------

#ifdef SYSTEM_GLOBAL
    #define SYSTEM_EXTERN
#else
    #define SYSTEM_EXTERN extern
#endif

//-------------------------------------------------------------------------------------------------
// Global variable(s) and constant(s)
//-------------------------------------------------------------------------------------------------

SYSTEM_EXTERN   uint32_t        SystemCoreClock;

//-------------------------------------------------------------------------------------------------
// Function prototype(s)
//-------------------------------------------------------------------------------------------------

void    SystemInit              (void);

//-------------------------------------------------------------------------------------------------
